ACAPI::DesignOptions::MissingDesignOption Struct Reference
Design Options
This expresses that an element had some design option linked to it, but this is missing now. This situation can occur for example if in teamwork, user A links an element to a design option, and meanwhile user B deletes this design option. More...
#include <ElemDesignOptionStatus.hpp>
Detailed Description
This expresses that an element had some design option linked to it, but this is missing now. This situation can occur for example if in teamwork, user A links an element to a design option, and meanwhile user B deletes this design option.